const Message: React.FC<null> =  () => (
  <svg xmlns="http://www.w3.org/2000/svg" xmlnsXlink="http://www.w3.org/1999/xlink" width="22" height="22" viewBox="0 0 22 22">
  <defs>
    {/* <style>
      .cls-1 {
        fill: #8c8c8c;
        stroke-linejoin: round;
      }

      .cls-1, .cls-4 {
        stroke: #8c8c8c;
      }

      .cls-2 {
        clip-path: url(#clip-path);
      }

      .cls-3 {
        fill: #fff;
      }

      .cls-4 {
        fill: none;
      }

      .cls-5, .cls-6 {
        stroke: none;
      }

      .cls-6 {
        fill: #8c8c8c;
      }
    </style> */}
    <clipPath id="clip-path">
      <rect id="矩形_463" data-name="矩形 463" style={{fill: "#8c8c8c", strokeLinejoin: "round"}} width="22" height="22" transform="translate(576 154)"/>
    </clipPath>
  </defs>
  <g id="icon_bianji" data-name="icon/bianji" style={{clipPath: "url(#clip-path)"}} transform="translate(-576 -154)">
    <g id="路径_690" data-name="路径 690" style={{fill: "#fff"}} transform="translate(578 156)">
      <path style={{stroke: "none"}} d="M 4.90773868560791 16.70351028442383 L 3.309654712677002 14.38501358032227 L 3.115894556045532 14.10390377044678 L 2.774474620819092 14.10390377044678 L 0.6500046253204346 14.10390377044678 L 0.6500046253204346 0.6500037312507629 L 17.06044387817383 0.6500037312507629 L 17.06044387817383 14.10390377044678 L 7.589274406433105 14.10390377044678 L 7.304444789886475 14.10390377044678 L 7.111384391784668 14.31331348419189 L 4.90773868560791 16.70351028442383 Z"/>
      <path style={{stroke: "none", fill: "#8c8c8c"}} d="M 1.300004959106445 1.300003051757812 L 1.300004959106445 13.45390319824219 L 2.774474143981934 13.45390319824219 L 3.457314491271973 13.45390319824219 L 3.844844818115234 14.01612377166748 L 4.981258392333984 15.66483020782471 L 6.63349437713623 13.87272357940674 L 7.019624710083008 13.45390319824219 L 7.589274406433105 13.45390319824219 L 16.41044425964355 13.45390319824219 L 16.41044425964355 1.300003051757812 L 1.300004959106445 1.300003051757812 M 3.814697265625e-06 3.814697265625e-06 L 17.71044540405273 3.814697265625e-06 L 17.71044540405273 14.75390434265137 L 7.589274406433105 14.75390434265137 L 4.834224700927734 17.74218368530273 L 2.774474143981934 14.75390434265137 L 3.814697265625e-06 14.75390434265137 L 3.814697265625e-06 3.814697265625e-06 Z"/>
    </g>
    <line id="直线_110" data-name="直线 110" style={{fill: "none"}} x2="9" transform="translate(582.5 160.5)"/>
    <line id="直线_111" data-name="直线 111" style={{fill: "none"}} x2="9" transform="translate(582.5 164.5)"/>
  </g>
</svg>
)
export default Message;
